In [140]:
import pandas as pd
import os
from library import start

In [141]:
file = 'teacher_cert_yr1718.csv'
certification = pd.read_csv(os.path.join(start.data_path, 'tea', 'teachers', file),
                           low_memory=False)

In [142]:
file = 'teacher_course_yr1718.csv'
assignments = pd.read_csv(os.path.join(start.data_path, 'tea', 'teachers', file))

In [143]:
assignments[assignments.teacher_id == 'Q3Q2QF*48']

,Unnamed: 0,teacher_id,district,campus,campus_elem,campus_middle,campus_high,course_ela,course_elem,course_math,course_science,course_cte
134944,24,Q3Q2QF*48,1902,1902001,False,False,True,False,False,True,False,False

In [144]:
teachers = assignments.merge(certification, on = ['teacher_id', 'district'], how = 'left', indicator = '_merge')
teachers[teachers.teacher_id == 'Q3Q2QF*48']

,Unnamed: 0,teacher_id,district,campus,campus_elem,campus_middle,campus_high,course_ela,course_elem,course_math,...,cert_middle,cert_high,cert_area_elem,cert_area_ela,cert_area_math,cert_area_sci,cert_secondary_ela,cert_secondary_math,cert_secondary_sci,_merge
134944,24,Q3Q2QF*48,1902,1902001,False,False,True,False,False,True,...,True,True,True,False,False,False,False,False,False,both

In [145]:
teachers['certification'] = teachers.certification.astype(bool)
teachers['vocational'] = teachers.vocational.astype(bool)
teachers['cert_elem'] = teachers.cert_elem.astype(bool)
teachers['cert_middle'] = teachers.cert_middle.astype(bool)
teachers['cert_high'] = teachers.cert_high.astype(bool)
teachers['cert_area_elem'] = teachers.cert_area_elem.astype(bool)
teachers['cert_area_ela'] = teachers.cert_area_ela.astype(bool)
teachers['cert_area_math'] = teachers.cert_area_math.astype(bool)
teachers['cert_area_sci'] = teachers.cert_area_sci.astype(bool)
teachers['cert_secondary_ela'] = teachers.cert_secondary_ela.astype(bool)
teachers['cert_secondary_sci'] = teachers.cert_secondary_sci.astype(bool)
teachers['cert_secondary_math'] = teachers.cert_secondary_math.astype(bool)

In [146]:
teachers._merge.value_counts()

both          353574
left_only       8439
right_only         0
Name: _merge, dtype: int64

In [147]:
high_math = teachers[(teachers.course_math == True)]
high_math = high_math[(high_math.campus_high == True) | (high_math.campus_middle == True)]
high_math[high_math.campus == 1902001]

,Unnamed: 0,teacher_id,district,campus,campus_elem,campus_middle,campus_high,course_ela,course_elem,course_math,...,cert_middle,cert_high,cert_area_elem,cert_area_ela,cert_area_math,cert_area_sci,cert_secondary_ela,cert_secondary_math,cert_secondary_sci,_merge
134944,24,Q3Q2QF*48,1902,1902001,False,False,True,False,False,True,...,True,True,True,False,False,False,False,False,False,both
134958,38,V35*6D044,1902,1902001,False,False,True,False,False,True,...,True,True,True,True,False,False,False,False,False,both
134959,39,V35110245,1902,1902001,False,False,True,False,False,True,...,True,True,False,False,True,False,False,True,False,both

In [148]:
high_math = high_math.groupby(['campus', 'district']).mean()
high_math = high_math[['certification', 'cert_secondary_math']]
high_math.sample(10)

                    certification  cert_secondary_math
campus    district
15915022  15915               1.0             0.666667
15907195  15907               1.0             1.000000
57803014  57803               1.0             1.000000
161916198 161916              1.0             1.000000
245903041 245903              1.0             0.250000
227901059 227901              1.0             0.250000
116901001 116901              1.0             0.857143
57803047  57803               1.0             0.250000
43910007  43910               1.0             0.846154
101903141 101903              1.0             0.000000

In [149]:
high_sci = teachers[(teachers.course_science == True)]
high_sci = high_sci[(high_sci.campus_high == True)]
high_sci = high_sci.groupby(['campus', 'district']).mean()
high_sci = high_sci[['certification', 'cert_secondary_sci']]
high_sci.sample(10)

                    certification  cert_secondary_sci
campus    district
7904002   7904                1.0            0.000000
139911002 139911              1.0            0.666667
129903003 129903              1.0            1.000000
15916001  15916               1.0            0.645161
195902001 195902              1.0            0.100000
11904002  11904               1.0            0.500000
209901001 209901              1.0            0.375000
25905001  25905               1.0            0.250000
15827001  15827               1.0            1.000000
230903001 230903              1.0            0.750000

In [150]:
high_ela = teachers[(teachers.course_ela == True)]
high_ela = high_ela[(high_ela.campus_high == True)]
high_ela = high_ela.groupby(['campus', 'district']).mean()
high_ela = high_ela[['certification', 'cert_secondary_ela']]
high_ela.sample(10)

                    certification  cert_secondary_ela
campus    district
147902003 147902              1.0            1.000000
43907004  43907               1.0            0.666667
40901002  40901               1.0            1.000000
57814003  57814               1.0            0.333333
212906001 212906              1.0            0.800000
71902002  71902               1.0            0.777778
180903001 180903              1.0            0.285714
101902003 101902              1.0            0.838710
46902007  46902               1.0            1.000000
167902002 167902              1.0            0.400000

In [151]:
elem = teachers[(teachers.course_ela == True)]
elem = elem[(elem.campus_elem == True)]
elem = elem.groupby(['campus', 'district']).mean()
elem = elem[['certification', 'cert_area_elem']]
elem.sample(10)

                    certification  cert_area_elem
campus    district
108807110 108807         1.000000        0.785714
107902101 107902         1.000000        1.000000
178909042 178909         1.000000        0.800000
79901004  79901          1.000000        0.333333
74912101  74912          1.000000        1.000000
229905101 229905         1.000000        1.000000
214901104 214901         1.000000        0.777778
14906122  14906          0.977273        0.863636
251902101 251902         1.000000        0.600000
101903108 101903         1.000000        0.882353

In [153]:
cte = teachers[(teachers.course_cte == True)]
cte = cte[(cte.campus_elem == True)]
cte = cte.groupby(['campus', 'district']).mean()
cte = cte[['certification', 'vocational']]
cte.sample(10)

                    certification  vocational
campus    district
71806004  71806              1.00       0.000
232904001 232904             1.00       0.000
1906102   1906               1.00       0.000
227825001 227825             1.00       0.500
72801109  72801              0.75       0.500
101845004 101845             1.00       0.000
101828001 101828             1.00       1.000
60914001  60914              1.00       0.000
73901001  73901              1.00       0.375
161807005 161807             1.00       0.750